import matplotlib.pyplot as plt

measurements1 = [4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,5,4,4,4,5,4,4]
measurements2 = [4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,4,5,4,5,4,4,5,4]
measurements3 = [4,4,4,4,4,4,4,4,4,4,5,4,4,4,4,4,4,4,4,4,4,4,4,6,7,5,8,8,9,9,9,10,11,12,12,13,14,14,14,14,17,22,24,28,30,31,34,37,47,71,116,235,189,236,275,295,320,341]

plt.figure(figsize=(10, 6))

plt.plot(measurements1, label='последовательный', color='blue')
plt.plot(measurements2, label='обратный', color='green')
plt.plot(measurements3, label='случайный', color='red')

plt.title("Графики измерений")
plt.xlabel("размер массива (256*(1.2**n), где n - целое число на оси Ох)")
plt.ylabel("количество тактов процессора")
plt.legend()

plt.grid(True)
plt.show()
