import matplotlib.pyplot as plt

measurements1 = [10, 10, 10, 10, 10, 10, 10, 10, 10, 5, 10, 10, 12, 10, 6, 10, 10, 15, 10, 13, 10, 10, 5, 10, 9, 5, 5, 9, 5, 5, 5, 5, 5, 5, 5, 5, 5, 10, 9, 9, 5, 7, 5, 5, 9, 8, 6, 6, 10, 8, 8, 5, 5, 7, 8, 5, 5, 6]
measurements2 = [10, 10, 10, 10, 11, 10, 10, 10, 6, 5, 10, 10, 10, 10, 10, 10, 16, 10, 10, 13, 10, 12, 10, 10, 5, 5, 5, 9, 5, 5, 5, 6, 10, 10, 5, 5, 5, 9, 9, 9, 5, 5, 5, 5, 10, 10, 5, 9, 10, 9, 9, 5, 5, 8, 5, 7, 7, 7, ]
measurements3 = [10, 10, 10, 10, 10, 10, 10, 10, 6, 10, 10, 10, 5, 10, 10, 10, 10, 10, 10, 10, 6, 15, 16, 17, 9, 17, 10, 16, 5, 11, 11, 21, 24, 25, 16, 20, 21, 32, 33, 30, 35, 40, 42, 45, 47, 51, 79, 102, 181, 217, 249, 273, 282, 307, 319, 327, 337, 347]


plt.figure(figsize=(10, 6))

plt.plot(measurements1, label='последовательный', color='blue')
plt.plot(measurements2, label='обратный', color='green')
plt.plot(measurements3, label='случайный', color='red')

plt.title("Графики измерений")
plt.xlabel("размер массива (256*(1.2**n), где n - целое число на оси Ох)")
plt.ylabel("количество тактов процессора")
plt.legend()

plt.grid(True)
plt.show()
